; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image1 - mode
	image0 - mode
	thermograph2 - mode
	thermograph3 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star7 - direction
	GroundStation8 - direction
	Star4 - direction
	GroundStation9 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star2 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph3)
	(supports instrument1 image0)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation9)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 thermograph3)
	(supports instrument3 thermograph2)
	(supports instrument3 image0)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(pointing satellite1 Star7)
	(pointing satellite2 GroundStation0)
	(have_image Planet10 thermograph2)
	(have_image Phenomenon11 thermograph3)
	(have_image Planet12 image0)
))

)

; plan
1. (turn_to satellite1 star3 groundstation9)
   deleted: (pointing satellite1 groundstation9)
   added: (pointing satellite1 star3)
   goals met: 1 of 5
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 5
3. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 1 of 5
4. (turn_to satellite1 planet10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet10)
   goals met: 1 of 5
5. (take_image satellite1 planet10 instrument1 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 2 of 5
6. (turn_to satellite1 phenomenon11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 5
7. (take_image satellite1 phenomenon11 instrument1 thermograph3)
   added: (have_image phenomenon11 thermograph3)
   goals met: 3 of 5
8. (turn_to satellite1 planet12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet12)
   goals met: 3 of 5
9. (take_image satellite1 planet12 instrument1 image0)
   added: (have_image planet12 image0)
   goals met: 4 of 5
10. (turn_to satellite1 star7 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star7)
   goals met: 5 of 5
